<?php

require_once '../../vendor/autoload.php';

use OzonRocketSDK\Client\Client;

//-----------------------------------------------------------------------------------------
if (!session_id()) session_start();

//Тестовая среда
$account = 'TEST'; // ID для подключения к рабочей
$secure = null; // Секретный ключ для подключения к рабочей
//$timeout; // Необязательный параметр. Настройка клиента задающая общий тайм-аут запроса в секундах. При использовании 0 ждать бесконечно долго. По умолчанию 5.0
$client = (new Client($account, $secure /*, $timeout*/ ));


//-----------------------------------------------------------------------------------------
// Получить место передачи отправлений DropOff на склад
$result = $client->deliveryFromPlaces();
//var_dump($result);

//-----------------------------------------------------------------------------------------
// Получить информацию о складе возврата
$result = $client->deliveryReturnPlaces();
//var_dump($result);

//-----------------------------------------------------------------------------------------
// Получить список складов пикапа
$result = $client->deliveryPickupPlaces();
//var_dump($result);

